<!DOCTYPE html>
<html>
<head>
    <title>Справочник городов</title>
</head>
<body>
    <!-- Форма для ввода первой буквы города -->
    <form method="post">
        <label for="firstLetter">Введите первую букву города (u для вывода городов по возрастанию, l - по убыванию):</label><br>
        <input type="text" id="firstLetter" name="firstLetter">
        <input type="submit" value="Найти">
    </form>

    <?php
    $citiesTurkey = array(
        'Агачёрен' => array(
            'Население' => 3047,
            'Высота центра' => 1169,
        ),
        'Агры' => array(
            'Население' => 97839,
            'Высота центра' => 1632,
        ),
         'Адана' => array(
            'Население' => 13844,
            'Высота центра' => 23,
        ),
         'Адапазары' => array(
            'Население' => 377683,
            'Высота центра' => 31,
        ),
         'Аджипаям' => array(
            'Население' => 12588,
            'Высота центра' => 953,
        ),
         'Аланья' => array(
            'Население' => 364180,
            'Высота центра' => 27,
        ),
        'Ахлат' => array(
            'Население' => 19951,
            'Высота центра' => 1650,
        ),
        'Анкара' => array(
            'Население' => 5445026,
            'Высота центра' => 938,
        ),
        'Аксарай' => array(
            'Население' => 129949,
            'Высота центра' => 980,
        ),
        'Бабаэски' => array(
            'Население' => 28200,
            'Высота центра' => 55,
        ),
        'Байбурт' => array(
            'Население' => 32782,
            'Высота центра' => 1550,
        ),
        'Балыкесир' => array(
            'Население' => 32782,
            'Высота центра' => 1550,
        ),
        'Бартын' => array(
            'Население' => 56557,
            'Высота центра' => 25,
        ),
        'Бахче' => array(
            'Население' => 12841,
            'Высота центра' => 650,
        ),
        'Башкале' => array(
            'Население' => 14601,
            'Высота центра' => 21,
        ),
        'Бурса' => array(
            'Население' => 2994521,
            'Высота центра' => 100,
        ),
        'Бюньян' => array(
            'Население' => 12505,
            'Высота центра' => 1337,
        ),
        'Вакфыкебир' => array(
            'Население' => 14157,
            'Высота центра' => 68,
        ),
        'Газиантеп' => array(
            'Население' => 1680723,
            'Высота центра' => 850,
        ),
        'Гекчебей' => array(
            'Население' => 7273,
            'Высота центра' => 61,
        ),
        'Гелиболу' => array(
            'Население' => 27160,
            'Высота центра' => 0,
        ),
        'Герменджик' => array(
            'Население' => 12635,
            'Высота центра' => 65,
        ),
        'Гиресун' => array(
            'Население' => 135920,
            'Высота центра' => 10,
        ),
        'Гюлагач' => array(
            'Население' => 4565,
            'Высота центра' => 1162,
        ),
        'Гюлюч' => array(
            'Население' => 7249,
            'Высота центра' => 97,
        ),
        'Гюрюн' => array(
            'Население' => 18009,
            'Высота центра' => 1334,
        ),
        'Даламан' => array(
            'Население' => 37364,
            'Высота центра' => 8,
        ),
        'Дальян' => array(
            'Население' => 4848,
            'Высота центра' => 3,
        ),
        'Даренде' => array(
            'Население' => 8645,
            'Высота центра' => 1006,
        ),
        'Демре' => array(
            'Население' => 27691,
            'Высота центра' => 10,
        ),
        'Денизли' => array(
            'Население' => 544424,
            'Высота центра' => 354,
        ),
        'Дикили' => array(
            'Население' => 15530,
            'Высота центра' => 201,
        ),
        'Дюздже' => array(
            'Население' => 240633,
            'Высота центра' => 160,
        ),
        // 35
        'Зара' => array(
            'Население' => 11588,
            'Высота центра' => 1350,
        ),
        'Измир' => array(
            'Население' => 2948160,
            'Высота центра' => 25,
        ),
        'Измит' => array(
            'Население' => 302960,
            'Высота центра' => 100,
        ),
        'Имамоглу' => array(
            'Население' => 21331,
            'Высота центра' => 73,
        ),
        'Искендерун' => array(
            'Население' => 184833,
            'Высота центра' => 8,
        ),
        // 40
        'Йозгат' => array(
            'Население' => 432560,
            'Высота центра' => 1335,
        ),
        'Кадынханы' => array(
            'Население' => 33036,
            'Высота центра' => 1127,
        ),
        'Кандыра' => array(
            'Население' => 13511,
            'Высота центра' => 18,
        ),
        'Карабюк' => array(
            'Население' => 108167,
            'Высота центра' => 354,
        ),
        'Караман' => array(
            'Население' => 152450,
            'Высота центра' => 1039,
        ),
        // 45
        'Каш' => array(
            'Население' => 62866,
            'Высота центра' => 100,
        ),
        'Кастамону' => array(
            'Население' => 82289,
            'Высота центра' => 904,
        ),
        'Кемер' => array(
            'Население' => 49383,
            'Высота центра' => 4,
        ),
        'Коркутели' => array(
            'Население' => 56285,
            'Высота центра' => 1020,
        ),
        'Ладик' => array(
            'Население' => 8626,
            'Высота центра' => 913,
        ),
        // 50
        'Мармарис' => array(
            'Население' => 95851,
            'Высота центра' => 7,
        ),
        'Аванос' => array(
            'Население' => 13210,
            'Высота центра' => 935,
        )

    );
function printInfo($associativeArray) {
    foreach ($associativeArray as $key => $value) {
        echo "<p style='padding: 0px 0px 0px 10px;margin: 0 0 0 0;'> $key = $value </p>";
    }
}

function printCities($cities, $firstLetter) {
    foreach ($cities as $key => $value) {
        $keyFirstLetter = mb_substr($key, 0, 1, 'UTF-8');
        if (mb_strtoupper($keyFirstLetter) === mb_strtoupper($firstLetter) || ($firstLetter == 'U') || ($firstLetter == 'L')) {
            echo "Город: $key, Информация: <br>";
            echo printInfo($value);
            echo "<br>";
        }
    }
}

$firstLetter = mb_strtoupper($_POST['firstLetter'] ?? ''); // Use the null coalescing operator to handle the case when $_POST['firstLetter'] is not set

// Проверка, была ли отправлена первая буква города
if ($_SERVER["REQUEST_METHOD"] == "POST") {
    if (($firstLetter != 'U') && ($firstLetter != 'L')) {
        printCities($citiesTurkey, $firstLetter);
    }
    if (mb_strtoupper($firstLetter) == 'U') {
        // Sort the array in ascending order and then print cities
        ksort($citiesTurkey, SORT_STRING);
        printCities($citiesTurkey, 'U');
    }
    if (mb_strtoupper($firstLetter) == 'L') {
        // Sort the array in descending order and then print cities
        krsort($citiesTurkey, SORT_STRING);
        printCities($citiesTurkey, 'L');
    }
}
    ?>
</body>
</html>